int main() {
//на вхід подаються два цілих числа
    int var1 = 10;
    int var2 = 17;

//пошук максимального з них за допомогою тернарного оператора
    int max;
    if(var1 > var2){
        max = var1;
    } else{
        max = var2;
    }

//якщо число < 0, беремо зворотнє число для коректної роботи циклу
    if(max < 0){
        max = -max;
    }

//пошук суми усіх цілих дільників цього числа
    int sum = 0;
    for(int i = 1; i <= max; i = i + 1){
        if(max % i == 0){
        //число i є дільником числа
            sum = sum + i;
        }
    }
    return sum;
}
